{
  "Premier League": {
  "Arsenal": "Arsenal went unbeaten in the 2003–04 Premier League season.",
  "Aston Villa": "Aston Villa were one of the founding members of the Football League in 1888.",
  "Bournemouth": "AFC Bournemouth's nickname is 'The Cherries' due to their red and black kit.",
  "Brentford": "Brentford moved to their new home, the Brentford Community Stadium, in 2020.",
  "Brighton": "Brighton's home ground is the American Express Community Stadium, known as the Amex.",
  "Chelsea": "Chelsea won the UEFA Champions League in 2012 and 2021.",
  "Crystal Palace": "Crystal Palace's mascot is an eagle named Kayla.",
  "Everton": "Everton have played more seasons in the top flight than any other English club.",
  "Fulham": "Fulham is London's oldest professional football club, founded in 1879.",
  "Ipswich": "Ipswich Town won the English league title in their first season in the top division in 1961–62.",
  "Leicester": "Leicester City won their first Premier League title in the 2015–16 season.",
  "Liverpool": "Liverpool has won six UEFA Champions League titles, the most of any English club.",
  "Manchester City": "Manchester City achieved a domestic treble in the 2018–19 season.",
  "Manchester United": "Manchester United has won a record 20 English league titles.",
  "Newcastle": "Newcastle United's home ground, St James' Park, has been their home since 1892.",
  "Nottingham Forest": "Nottingham Forest won back-to-back European Cups in 1979 and 1980.",
  "Southampton": "Southampton's nickname 'The Saints' comes from their origins as a church football team.",
  "Tottenham": "Tottenham Hotspur was the first British club to win a European trophy, the Cup Winners' Cup in 1963.",
  "West Ham": "West Ham United's anthem is 'I'm Forever Blowing Bubbles.'",
  "Wolves": "Wolves were one of the founding members of the Football League in 1888."
  },
  "La Liga": {
  "Alaves": "Deportivo Alavés reached the UEFA Cup final in 2001.",
  "Athletic Club": "Athletic Club only fields players native to or trained in the Basque Country.",
  "Atletico Madrid": "Atlético Madrid's nickname is 'Los Colchoneros' due to their red and white striped jerseys.",
  "Barcelona": "Barcelona's stadium, Camp Nou, is the largest in Europe.",
  "Celta Vigo": "Celta Vigo's nickname is 'Os Celestes' due to their sky blue shirts.",
  "Getafe": "Getafe CF was founded in 1983 and reached the UEFA Cup quarter-finals in 2008.",
  "Girona": "Girona FC achieved their first promotion to La Liga in 2017.",
  "Las Palmas": "UD Las Palmas is based in the Canary Islands.",
  "Leganes": "CD Leganés' nickname is 'Los Pepineros' (The Cucumber Growers).",
  "Mallorca": "RCD Mallorca won the Copa del Rey in 2003.",
  "Osasuna": "CA Osasuna's name means 'health' in Basque.",
  "Rayo Vallecano": "Rayo Vallecano is based in the Madrid neighborhood of Vallecas.",
  "Real Betis": "Real Betis won the Copa del Rey in 2005 and 2022.",
  "Real Madrid": "Real Madrid has won a record 14 UEFA Champions League titles.",
  "Real Sociedad": "Real Sociedad won back-to-back La Liga titles in 1981 and 1982.",
  "Sevilla": "Sevilla FC has won the UEFA Europa League a record seven times.",
  "Valencia": "Valencia CF's stadium, Mestalla, is known for its steep stands.",
  "Valladolid": "Real Valladolid's nickname is 'Pucela,' a reference to Joan of Arc.",
  "Villarreal": "Villarreal CF won their first major trophy, the UEFA Europa League, in 2021.",
  "Espanyol": "RCD Espanyol shares its city with Barcelona and was founded in 1900."
  },
  "Bundesliga": {
  "Bayern München": "Bayern Munich has won the most Bundesliga titles, with over 30 championships.",
  "SC Freiburg": "SC Freiburg is known for its strong youth academy and sustainable practices.",
  "VfL Wolfsburg": "VfL Wolfsburg won their first Bundesliga title in 2009.",
  "Werder Bremen": "Werder Bremen has won the Bundesliga four times.",
  "Borussia Mönchengladbach": "Mönchengladbach won five Bundesliga titles in the 1970s.",
  "FSV Mainz 05": "Mainz 05's stadium is named Mewa Arena.",
  "Borussia Dortmund": "Borussia Dortmund's fans are known for creating the 'Yellow Wall' at Signal Iduna Park.",
  "1899 Hoffenheim": "TSG 1899 Hoffenheim quickly rose from regional leagues to the Bundesliga by 2008.",
  "Bayer Leverkusen": "Bayer Leverkusen is known as 'Neverkusen' due to several runner-up finishes.",
  "Eintracht Frankfurt": "Eintracht Frankfurt won the UEFA Europa League in 2022.",
  "FC Augsburg": "FC Augsburg was founded in 1907 and reached the Bundesliga in 2011.",
  "VfB Stuttgart": "VfB Stuttgart won the Bundesliga in 2007.",
  "RB Leipzig": "RB Leipzig was founded in 2009 and reached the Bundesliga in 2016.",
  "VfL Bochum": "VfL Bochum's stadium, Vonovia Ruhrstadion, has a capacity of over 27,000.",
  "1. FC Heidenheim": "1. FC Heidenheim achieved their first promotion to the Bundesliga in 2023.",
  "Union Berlin": "Union Berlin achieved their first-ever promotion to the Bundesliga in 2019.",
  "FC St. Pauli": "FC St. Pauli is renowned for its left-wing fan culture.",
  "Holstein Kiel": "Holstein Kiel made their Bundesliga debut in the 2024–25 season.",
  "SV Elversberg": "SV Elversberg earned promotion to the 2. Bundesliga for the first time in 2023 and continues to rise."
  },
  "Serie A": {
    "Lazio": "Lazio shares the Stadio Olimpico with rivals Roma.",
    "AC Milan": "AC Milan has won seven European Cup/Champions League titles.",
    "Cagliari": "Cagliari won their only Serie A title in 1970.",
    "Napoli": "Napoli won their third Serie A title in 2023.",
    "Udinese": "Udinese Calcio has been a consistent presence in Serie A since the 1990s.",
    "Genoa": "Genoa CFC is Italy's oldest football club, founded in 1893.",
    "Juventus": "Juventus has won a record 36 Serie A titles.",
    "AS Roma": "AS Roma won the inaugural UEFA Europa Conference League in 2022.",
    "Atalanta": "Atalanta won their first major trophy, the Coppa Italia, in 1963.",
    "Bologna": "Bologna FC has won seven Italian league titles.",
    "Fiorentina": "Fiorentina was the first Italian club to reach a European Cup final in 1957.",
    "Torino": "Torino FC's 'Grande Torino' team dominated Italian football in the 1940s.",
    "Verona": "Hellas Verona won their only Serie A title in the 1984–85 season.",
    "Inter": "Inter Milan is the only Italian club never relegated from Serie A.",
    "Empoli": "Empoli FC is known for developing young talents.",
    "Venezia": "Venezia FC is known for its unique location in the canals of Venice.",
    "Parma": "Parma won three European trophies in the 1990s.",
    "Lecce": "US Lecce's stadium is the Stadio Via del Mare.",
    "Como": "Como 1907 returned to Serie A in the 2024–25 season after 21 years.",
    "Monza": "AC Monza reached Serie A for the first time in 2022."
  }
}
